espressif/esp-idf/components/soc/esp32c5/beta3/include/soc/lp_io_reg.h
/** LP_IO_PIN3_REG register
 *  need des
 */
#define LP_IO_PIN3_REG (DR_REG_LP_IO_BASE + 0x34)
/** LP_IO_LP_GPIO3_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO3_SYNC_BYPASS_M  (LP_IO_LP_GPIO3_SYNC_BYPASS_V << LP_IO_LP_GPIO3_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO3_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO3_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO3_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO3_PAD_DRIVER_M  (LP_IO_LP_GPIO3_PAD_DRIVER_V << LP_IO_LP_GPIO3_PAD_DRIVER_S)
#define LP_IO_LP_GPIO3_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO3_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO3_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO3_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO3_INT_TYPE_M  (LP_IO_LP_GPIO3_INT_TYPE_V << LP_IO_LP_GPIO3_INT_TYPE_S)
#define LP_IO_LP_GPIO3_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO3_INT_TYPE_S  7
/** LP_IO_LP_GPIO3_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO3_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO3_WAKEUP_ENABLE_V << LP_IO_LP_GPIO3_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO3_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO3_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO3_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO3_FILTER_EN_M  (LP_IO_LP_GPIO3_FILTER_EN_V << LP_IO_LP_GPIO3_FILTER_EN_S)
#define LP_IO_LP_GPIO3_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO3_FILTER_EN_S  11

/** LP_IO_PIN4_REG register
 *  need des
 */
#define LP_IO_PIN4_REG (DR_REG_LP_IO_BASE + 0x38)
/** LP_IO_LP_GPIO4_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO4_SYNC_BYPASS_M  (LP_IO_LP_GPIO4_SYNC_BYPASS_V << LP_IO_LP_GPIO4_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO4_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO4_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO4_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO4_PAD_DRIVER_M  (LP_IO_LP_GPIO4_PAD_DRIVER_V << LP_IO_LP_GPIO4_PAD_DRIVER_S)
#define LP_IO_LP_GPIO4_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO4_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO4_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO4_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO4_INT_TYPE_M  (LP_IO_LP_GPIO4_INT_TYPE_V << LP_IO_LP_GPIO4_INT_TYPE_S)
#define LP_IO_LP_GPIO4_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO4_INT_TYPE_S  7
/** LP_IO_LP_GPIO4_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO4_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO4_WAKEUP_ENABLE_V << LP_IO_LP_GPIO4_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO4_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO4_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO4_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO4_FILTER_EN_M  (LP_IO_LP_GPIO4_FILTER_EN_V << LP_IO_LP_GPIO4_FILTER_EN_S)
#define LP_IO_LP_GPIO4_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO4_FILTER_EN_S  11

/** LP_IO_PIN5_REG register
 *  need des
 */
#define LP_IO_PIN5_REG (DR_REG_LP_IO_BASE + 0x3c)
/** LP_IO_LP_GPIO5_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO5_SYNC_BYPASS_M  (LP_IO_LP_GPIO5_SYNC_BYPASS_V << LP_IO_LP_GPIO5_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO5_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO5_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO5_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO5_PAD_DRIVER_M  (LP_IO_LP_GPIO5_PAD_DRIVER_V << LP_IO_LP_GPIO5_PAD_DRIVER_S)
#define LP_IO_LP_GPIO5_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO5_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO5_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO5_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO5_INT_TYPE_M  (LP_IO_LP_GPIO5_INT_TYPE_V << LP_IO_LP_GPIO5_INT_TYPE_S)
#define LP_IO_LP_GPIO5_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO5_INT_TYPE_S  7
/** LP_IO_LP_GPIO5_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO5_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO5_WAKEUP_ENABLE_V << LP_IO_LP_GPIO5_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO5_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO5_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO5_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO5_FILTER_EN_M  (LP_IO_LP_GPIO5_FILTER_EN_V << LP_IO_LP_GPIO5_FILTER_EN_S)
#define LP_IO_LP_GPIO5_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO5_FILTER_EN_S  11

/** LP_IO_PIN6_REG register
 *  need des
 */
#define LP_IO_PIN6_REG (DR_REG_LP_IO_BASE + 0x40)
/** LP_IO_LP_GPIO6_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO6_SYNC_BYPASS_M  (LP_IO_LP_GPIO6_SYNC_BYPASS_V << LP_IO_LP_GPIO6_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO6_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO6_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO6_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO6_PAD_DRIVER_M  (LP_IO_LP_GPIO6_PAD_DRIVER_V << LP_IO_LP_GPIO6_PAD_DRIVER_S)
#define LP_IO_LP_GPIO6_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO6_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO6_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO6_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO6_INT_TYPE_M  (LP_IO_LP_GPIO6_INT_TYPE_V << LP_IO_LP_GPIO6_INT_TYPE_S)
#define LP_IO_LP_GPIO6_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO6_INT_TYPE_S  7
/** LP_IO_LP_GPIO6_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO6_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO6_WAKEUP_ENABLE_V << LP_IO_LP_GPIO6_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO6_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO6_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO6_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO6_FILTER_EN_M  (LP_IO_LP_GPIO6_FILTER_EN_V << LP_IO_LP_GPIO6_FILTER_EN_S)
#define LP_IO_LP_GPIO6_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO6_FILTER_EN_S  11

/** LP_IO_PIN7_REG register
 *  need des
 */
#define LP_IO_PIN7_REG (DR_REG_LP_IO_BASE + 0x44)
/** LP_IO_LP_GPIO7_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO7_SYNC_BYPASS_M  (LP_IO_LP_GPIO7_SYNC_BYPASS_V << LP_IO_LP_GPIO7_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO7_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO7_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO7_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO7_PAD_DRIVER_M  (LP_IO_LP_GPIO7_PAD_DRIVER_V << LP_IO_LP_GPIO7_PAD_DRIVER_S)
#define LP_IO_LP_GPIO7_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO7_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO7_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO7_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO7_INT_TYPE_M  (LP_IO_LP_GPIO7_INT_TYPE_V << LP_IO_LP_GPIO7_INT_TYPE_S)
#define LP_IO_LP_GPIO7_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO7_INT_TYPE_S  7
/** LP_IO_LP_GPIO7_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO7_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO7_WAKEUP_ENABLE_V << LP_IO_LP_GPIO7_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO7_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO7_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO7_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO7_FILTER_EN_M  (LP_IO_LP_GPIO7_FILTER_EN_V << LP_IO_LP_GPIO7_FILTER_EN_S)
#define LP_IO_LP_GPIO7_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO7_FILTER_EN_S  11

/** LP_IO_GPIO0_REG register
 *  need des
 */
#define LP_IO_GPIO0_REG (DR_REG_LP_IO_BASE + 0x48)
/** LP_IO_LP_GPIO0_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO0_MCU_OE_M  (LP_IO_LP_GPIO0_MCU_OE_V << LP_IO_LP_GPIO0_MCU_OE_S)
#define LP_IO_LP_GPIO0_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO0_MCU_OE_S  0
/** LP_IO_LP_GPIO0_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO0_SLP_SEL_M  (LP_IO_LP_GPIO0_SLP_SEL_V << LP_IO_LP_GPIO0_SLP_SEL_S)
#define LP_IO_LP_GPIO0_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO0_SLP_SEL_S  1
/** LP_IO_LP_GPIO0_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO0_MCU_WPD_M  (LP_IO_LP_GPIO0_MCU_WPD_V << LP_IO_LP_GPIO0_MCU_WPD_S)
#define LP_IO_LP_GPIO0_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO0_MCU_WPD_S  2
/** LP_IO_LP_GPIO0_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO0_MCU_WPU_M  (LP_IO_LP_GPIO0_MCU_WPU_V << LP_IO_LP_GPIO0_MCU_WPU_S)
#define LP_IO_LP_GPIO0_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO0_MCU_WPU_S  3
/** LP_IO_LP_GPIO0_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO0_MCU_IE_M  (LP_IO_LP_GPIO0_MCU_IE_V << LP_IO_LP_GPIO0_MCU_IE_S)
#define LP_IO_LP_GPIO0_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO0_MCU_IE_S  4
/** LP_IO_LP_GPIO0_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO0_MCU_DRV_M  (LP_IO_LP_GPIO0_MCU_DRV_V << LP_IO_LP_GPIO0_MCU_DRV_S)
#define LP_IO_LP_GPIO0_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO0_MCU_DRV_S  5
/** LP_IO_LP_GPIO0_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO0_FUN_WPD_M  (LP_IO_LP_GPIO0_FUN_WPD_V << LP_IO_LP_GPIO0_FUN_WPD_S)
#define LP_IO_LP_GPIO0_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO0_FUN_WPD_S  7
/** LP_IO_LP_GPIO0_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO0_FUN_WPU_M  (LP_IO_LP_GPIO0_FUN_WPU_V << LP_IO_LP_GPIO0_FUN_WPU_S)
#define LP_IO_LP_GPIO0_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO0_FUN_WPU_S  8
/** LP_IO_LP_GPIO0_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO0_FUN_IE_M  (LP_IO_LP_GPIO0_FUN_IE_V << LP_IO_LP_GPIO0_FUN_IE_S)
#define LP_IO_LP_GPIO0_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO0_FUN_IE_S  9
/** LP_IO_LP_GPIO0_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO0_FUN_DRV_M  (LP_IO_LP_GPIO0_FUN_DRV_V << LP_IO_LP_GPIO0_FUN_DRV_S)
#define LP_IO_LP_GPIO0_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO0_FUN_DRV_S  10
/** LP_IO_LP_GPIO0_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO0_MCU_SEL_M  (LP_IO_LP_GPIO0_MCU_SEL_V << LP_IO_LP_GPIO0_MCU_SEL_S)
#define LP_IO_LP_GPIO0_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO0_MCU_SEL_S  12

