espressif/esp-idf/components/soc/esp32c5/beta3/include/soc/lp_io_reg.h
/** LP_IO_GPIO1_REG register
 *  need des
 */
#define LP_IO_GPIO1_REG (DR_REG_LP_IO_BASE + 0x4c)
/** LP_IO_LP_GPIO1_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO1_MCU_OE_M  (LP_IO_LP_GPIO1_MCU_OE_V << LP_IO_LP_GPIO1_MCU_OE_S)
#define LP_IO_LP_GPIO1_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO1_MCU_OE_S  0
/** LP_IO_LP_GPIO1_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO1_SLP_SEL_M  (LP_IO_LP_GPIO1_SLP_SEL_V << LP_IO_LP_GPIO1_SLP_SEL_S)
#define LP_IO_LP_GPIO1_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO1_SLP_SEL_S  1
/** LP_IO_LP_GPIO1_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO1_MCU_WPD_M  (LP_IO_LP_GPIO1_MCU_WPD_V << LP_IO_LP_GPIO1_MCU_WPD_S)
#define LP_IO_LP_GPIO1_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO1_MCU_WPD_S  2
/** LP_IO_LP_GPIO1_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO1_MCU_WPU_M  (LP_IO_LP_GPIO1_MCU_WPU_V << LP_IO_LP_GPIO1_MCU_WPU_S)
#define LP_IO_LP_GPIO1_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO1_MCU_WPU_S  3
/** LP_IO_LP_GPIO1_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO1_MCU_IE_M  (LP_IO_LP_GPIO1_MCU_IE_V << LP_IO_LP_GPIO1_MCU_IE_S)
#define LP_IO_LP_GPIO1_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO1_MCU_IE_S  4
/** LP_IO_LP_GPIO1_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO1_MCU_DRV_M  (LP_IO_LP_GPIO1_MCU_DRV_V << LP_IO_LP_GPIO1_MCU_DRV_S)
#define LP_IO_LP_GPIO1_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO1_MCU_DRV_S  5
/** LP_IO_LP_GPIO1_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO1_FUN_WPD_M  (LP_IO_LP_GPIO1_FUN_WPD_V << LP_IO_LP_GPIO1_FUN_WPD_S)
#define LP_IO_LP_GPIO1_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO1_FUN_WPD_S  7
/** LP_IO_LP_GPIO1_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO1_FUN_WPU_M  (LP_IO_LP_GPIO1_FUN_WPU_V << LP_IO_LP_GPIO1_FUN_WPU_S)
#define LP_IO_LP_GPIO1_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO1_FUN_WPU_S  8
/** LP_IO_LP_GPIO1_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO1_FUN_IE_M  (LP_IO_LP_GPIO1_FUN_IE_V << LP_IO_LP_GPIO1_FUN_IE_S)
#define LP_IO_LP_GPIO1_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO1_FUN_IE_S  9
/** LP_IO_LP_GPIO1_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO1_FUN_DRV_M  (LP_IO_LP_GPIO1_FUN_DRV_V << LP_IO_LP_GPIO1_FUN_DRV_S)
#define LP_IO_LP_GPIO1_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO1_FUN_DRV_S  10
/** LP_IO_LP_GPIO1_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO1_MCU_SEL_M  (LP_IO_LP_GPIO1_MCU_SEL_V << LP_IO_LP_GPIO1_MCU_SEL_S)
#define LP_IO_LP_GPIO1_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO1_MCU_SEL_S  12

/** LP_IO_GPIO2_REG register
 *  need des
 */
#define LP_IO_GPIO2_REG (DR_REG_LP_IO_BASE + 0x50)
/** LP_IO_LP_GPIO2_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO2_MCU_OE_M  (LP_IO_LP_GPIO2_MCU_OE_V << LP_IO_LP_GPIO2_MCU_OE_S)
#define LP_IO_LP_GPIO2_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO2_MCU_OE_S  0
/** LP_IO_LP_GPIO2_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO2_SLP_SEL_M  (LP_IO_LP_GPIO2_SLP_SEL_V << LP_IO_LP_GPIO2_SLP_SEL_S)
#define LP_IO_LP_GPIO2_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO2_SLP_SEL_S  1
/** LP_IO_LP_GPIO2_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO2_MCU_WPD_M  (LP_IO_LP_GPIO2_MCU_WPD_V << LP_IO_LP_GPIO2_MCU_WPD_S)
#define LP_IO_LP_GPIO2_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO2_MCU_WPD_S  2
/** LP_IO_LP_GPIO2_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO2_MCU_WPU_M  (LP_IO_LP_GPIO2_MCU_WPU_V << LP_IO_LP_GPIO2_MCU_WPU_S)
#define LP_IO_LP_GPIO2_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO2_MCU_WPU_S  3
/** LP_IO_LP_GPIO2_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO2_MCU_IE_M  (LP_IO_LP_GPIO2_MCU_IE_V << LP_IO_LP_GPIO2_MCU_IE_S)
#define LP_IO_LP_GPIO2_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO2_MCU_IE_S  4
/** LP_IO_LP_GPIO2_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO2_MCU_DRV_M  (LP_IO_LP_GPIO2_MCU_DRV_V << LP_IO_LP_GPIO2_MCU_DRV_S)
#define LP_IO_LP_GPIO2_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO2_MCU_DRV_S  5
/** LP_IO_LP_GPIO2_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO2_FUN_WPD_M  (LP_IO_LP_GPIO2_FUN_WPD_V << LP_IO_LP_GPIO2_FUN_WPD_S)
#define LP_IO_LP_GPIO2_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO2_FUN_WPD_S  7
/** LP_IO_LP_GPIO2_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO2_FUN_WPU_M  (LP_IO_LP_GPIO2_FUN_WPU_V << LP_IO_LP_GPIO2_FUN_WPU_S)
#define LP_IO_LP_GPIO2_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO2_FUN_WPU_S  8
/** LP_IO_LP_GPIO2_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO2_FUN_IE_M  (LP_IO_LP_GPIO2_FUN_IE_V << LP_IO_LP_GPIO2_FUN_IE_S)
#define LP_IO_LP_GPIO2_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO2_FUN_IE_S  9
/** LP_IO_LP_GPIO2_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO2_FUN_DRV_M  (LP_IO_LP_GPIO2_FUN_DRV_V << LP_IO_LP_GPIO2_FUN_DRV_S)
#define LP_IO_LP_GPIO2_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO2_FUN_DRV_S  10
/** LP_IO_LP_GPIO2_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO2_MCU_SEL_M  (LP_IO_LP_GPIO2_MCU_SEL_V << LP_IO_LP_GPIO2_MCU_SEL_S)
#define LP_IO_LP_GPIO2_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO2_MCU_SEL_S  12

/** LP_IO_GPIO3_REG register
 *  need des
 */
#define LP_IO_GPIO3_REG (DR_REG_LP_IO_BASE + 0x54)
/** LP_IO_LP_GPIO3_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO3_MCU_OE_M  (LP_IO_LP_GPIO3_MCU_OE_V << LP_IO_LP_GPIO3_MCU_OE_S)
#define LP_IO_LP_GPIO3_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO3_MCU_OE_S  0
/** LP_IO_LP_GPIO3_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO3_SLP_SEL_M  (LP_IO_LP_GPIO3_SLP_SEL_V << LP_IO_LP_GPIO3_SLP_SEL_S)
#define LP_IO_LP_GPIO3_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO3_SLP_SEL_S  1
/** LP_IO_LP_GPIO3_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO3_MCU_WPD_M  (LP_IO_LP_GPIO3_MCU_WPD_V << LP_IO_LP_GPIO3_MCU_WPD_S)
#define LP_IO_LP_GPIO3_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO3_MCU_WPD_S  2
/** LP_IO_LP_GPIO3_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO3_MCU_WPU_M  (LP_IO_LP_GPIO3_MCU_WPU_V << LP_IO_LP_GPIO3_MCU_WPU_S)
#define LP_IO_LP_GPIO3_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO3_MCU_WPU_S  3
/** LP_IO_LP_GPIO3_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO3_MCU_IE_M  (LP_IO_LP_GPIO3_MCU_IE_V << LP_IO_LP_GPIO3_MCU_IE_S)
#define LP_IO_LP_GPIO3_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO3_MCU_IE_S  4
/** LP_IO_LP_GPIO3_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO3_MCU_DRV_M  (LP_IO_LP_GPIO3_MCU_DRV_V << LP_IO_LP_GPIO3_MCU_DRV_S)
#define LP_IO_LP_GPIO3_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO3_MCU_DRV_S  5
/** LP_IO_LP_GPIO3_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO3_FUN_WPD_M  (LP_IO_LP_GPIO3_FUN_WPD_V << LP_IO_LP_GPIO3_FUN_WPD_S)
#define LP_IO_LP_GPIO3_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO3_FUN_WPD_S  7
/** LP_IO_LP_GPIO3_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO3_FUN_WPU_M  (LP_IO_LP_GPIO3_FUN_WPU_V << LP_IO_LP_GPIO3_FUN_WPU_S)
#define LP_IO_LP_GPIO3_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO3_FUN_WPU_S  8
/** LP_IO_LP_GPIO3_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO3_FUN_IE_M  (LP_IO_LP_GPIO3_FUN_IE_V << LP_IO_LP_GPIO3_FUN_IE_S)
#define LP_IO_LP_GPIO3_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO3_FUN_IE_S  9
/** LP_IO_LP_GPIO3_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO3_FUN_DRV_M  (LP_IO_LP_GPIO3_FUN_DRV_V << LP_IO_LP_GPIO3_FUN_DRV_S)
#define LP_IO_LP_GPIO3_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO3_FUN_DRV_S  10
/** LP_IO_LP_GPIO3_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO3_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO3_MCU_SEL_M  (LP_IO_LP_GPIO3_MCU_SEL_V << LP_IO_LP_GPIO3_MCU_SEL_S)
#define LP_IO_LP_GPIO3_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO3_MCU_SEL_S  12

/** LP_IO_GPIO4_REG register
 *  need des
 */
#define LP_IO_GPIO4_REG (DR_REG_LP_IO_BASE + 0x58)
/** LP_IO_LP_GPIO4_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO4_MCU_OE_M  (LP_IO_LP_GPIO4_MCU_OE_V << LP_IO_LP_GPIO4_MCU_OE_S)
#define LP_IO_LP_GPIO4_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO4_MCU_OE_S  0
/** LP_IO_LP_GPIO4_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO4_SLP_SEL_M  (LP_IO_LP_GPIO4_SLP_SEL_V << LP_IO_LP_GPIO4_SLP_SEL_S)
#define LP_IO_LP_GPIO4_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO4_SLP_SEL_S  1
/** LP_IO_LP_GPIO4_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO4_MCU_WPD_M  (LP_IO_LP_GPIO4_MCU_WPD_V << LP_IO_LP_GPIO4_MCU_WPD_S)
#define LP_IO_LP_GPIO4_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO4_MCU_WPD_S  2
/** LP_IO_LP_GPIO4_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO4_MCU_WPU_M  (LP_IO_LP_GPIO4_MCU_WPU_V << LP_IO_LP_GPIO4_MCU_WPU_S)
#define LP_IO_LP_GPIO4_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO4_MCU_WPU_S  3
/** LP_IO_LP_GPIO4_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO4_MCU_IE_M  (LP_IO_LP_GPIO4_MCU_IE_V << LP_IO_LP_GPIO4_MCU_IE_S)
#define LP_IO_LP_GPIO4_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO4_MCU_IE_S  4
/** LP_IO_LP_GPIO4_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO4_MCU_DRV_M  (LP_IO_LP_GPIO4_MCU_DRV_V << LP_IO_LP_GPIO4_MCU_DRV_S)
#define LP_IO_LP_GPIO4_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO4_MCU_DRV_S  5
/** LP_IO_LP_GPIO4_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO4_FUN_WPD_M  (LP_IO_LP_GPIO4_FUN_WPD_V << LP_IO_LP_GPIO4_FUN_WPD_S)
#define LP_IO_LP_GPIO4_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO4_FUN_WPD_S  7
/** LP_IO_LP_GPIO4_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO4_FUN_WPU_M  (LP_IO_LP_GPIO4_FUN_WPU_V << LP_IO_LP_GPIO4_FUN_WPU_S)
#define LP_IO_LP_GPIO4_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO4_FUN_WPU_S  8
/** LP_IO_LP_GPIO4_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO4_FUN_IE_M  (LP_IO_LP_GPIO4_FUN_IE_V << LP_IO_LP_GPIO4_FUN_IE_S)
#define LP_IO_LP_GPIO4_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO4_FUN_IE_S  9
/** LP_IO_LP_GPIO4_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO4_FUN_DRV_M  (LP_IO_LP_GPIO4_FUN_DRV_V << LP_IO_LP_GPIO4_FUN_DRV_S)
#define LP_IO_LP_GPIO4_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO4_FUN_DRV_S  10
/** LP_IO_LP_GPIO4_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO4_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO4_MCU_SEL_M  (LP_IO_LP_GPIO4_MCU_SEL_V << LP_IO_LP_GPIO4_MCU_SEL_S)
#define LP_IO_LP_GPIO4_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO4_MCU_SEL_S  12

/** LP_IO_GPIO5_REG register
 *  need des
 */
#define LP_IO_GPIO5_REG (DR_REG_LP_IO_BASE + 0x5c)
/** LP_IO_LP_GPIO5_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO5_MCU_OE_M  (LP_IO_LP_GPIO5_MCU_OE_V << LP_IO_LP_GPIO5_MCU_OE_S)
#define LP_IO_LP_GPIO5_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO5_MCU_OE_S  0
/** LP_IO_LP_GPIO5_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO5_SLP_SEL_M  (LP_IO_LP_GPIO5_SLP_SEL_V << LP_IO_LP_GPIO5_SLP_SEL_S)
#define LP_IO_LP_GPIO5_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO5_SLP_SEL_S  1
/** LP_IO_LP_GPIO5_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO5_MCU_WPD_M  (LP_IO_LP_GPIO5_MCU_WPD_V << LP_IO_LP_GPIO5_MCU_WPD_S)
#define LP_IO_LP_GPIO5_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO5_MCU_WPD_S  2
/** LP_IO_LP_GPIO5_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO5_MCU_WPU_M  (LP_IO_LP_GPIO5_MCU_WPU_V << LP_IO_LP_GPIO5_MCU_WPU_S)
#define LP_IO_LP_GPIO5_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO5_MCU_WPU_S  3
/** LP_IO_LP_GPIO5_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO5_MCU_IE_M  (LP_IO_LP_GPIO5_MCU_IE_V << LP_IO_LP_GPIO5_MCU_IE_S)
#define LP_IO_LP_GPIO5_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO5_MCU_IE_S  4
/** LP_IO_LP_GPIO5_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO5_MCU_DRV_M  (LP_IO_LP_GPIO5_MCU_DRV_V << LP_IO_LP_GPIO5_MCU_DRV_S)
#define LP_IO_LP_GPIO5_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO5_MCU_DRV_S  5
/** LP_IO_LP_GPIO5_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO5_FUN_WPD_M  (LP_IO_LP_GPIO5_FUN_WPD_V << LP_IO_LP_GPIO5_FUN_WPD_S)
#define LP_IO_LP_GPIO5_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO5_FUN_WPD_S  7
/** LP_IO_LP_GPIO5_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO5_FUN_WPU_M  (LP_IO_LP_GPIO5_FUN_WPU_V << LP_IO_LP_GPIO5_FUN_WPU_S)
#define LP_IO_LP_GPIO5_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO5_FUN_WPU_S  8
/** LP_IO_LP_GPIO5_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO5_FUN_IE_M  (LP_IO_LP_GPIO5_FUN_IE_V << LP_IO_LP_GPIO5_FUN_IE_S)
#define LP_IO_LP_GPIO5_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO5_FUN_IE_S  9
/** LP_IO_LP_GPIO5_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO5_FUN_DRV_M  (LP_IO_LP_GPIO5_FUN_DRV_V << LP_IO_LP_GPIO5_FUN_DRV_S)
#define LP_IO_LP_GPIO5_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO5_FUN_DRV_S  10
/** LP_IO_LP_GPIO5_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO5_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO5_MCU_SEL_M  (LP_IO_LP_GPIO5_MCU_SEL_V << LP_IO_LP_GPIO5_MCU_SEL_S)
#define LP_IO_LP_GPIO5_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO5_MCU_SEL_S  12

